export const REVIEWS = [
  {
    number: 0,
    FullName: "​Bektur Kerimkulov",
    date: "22 Декабря 2023",
    title:
      '"Отличный стоматолог! Профессионализм, забота и внимание к пациенту на высшем уровне. Результаты лечения превзошли ожидания. Рекомендую!"',
    color: "violet",
    rating: [1, 1, 1, 1, 1],
    avatar: "Be",
  },
  {
    number: 1,
    FullName: "Talantbekova Alina",
    date: "11 Сентября 2023",
    title:
      "Я БЛАГОДАРНА ВСЕМУ коллективу ESTETIC CLINIC, особенно моему доктору хирургу имплантологу ШАЙХИДИН УУЛУ ЖУМГАЛБЕКУ и девушки АССИСТЕНТУ. Молодцы ребята, отличная работа в паре. Доктор чуткий,деликатный,внимательный , руки ЛЕГКИЕ и теплые. Огромное спасибо Вы сделали все возможное, чтобы каждое мое посещение было комфортным. Хочу пожелать Вашему коллективу крепкого здоровья, творческого вдохновения и побольше благодарных пациентов. Прийду за следующим имплантом. Рекомендую Всем посетить. Доростоящая аппаратура. Все виды услуг. Я ДОВОЛЬНА ВАШЕЙ РАБОТОЙ👍🏻👍🏻👍🏻😍😍😍",
    color: "skyblue",
    rating: [1, 1, 1, 1, 1],
    avatar: "Ta",
  },
  {
    number: 1,
    FullName: "Kiril Novoselov",
    date: "1 Октября 2023",
    title:
      "Профессиональная работа врачей и приятный персонал. Зубная боль была сильной, но благодаря внимательному отношению и эффективному лечению, я чувствую себя гораздо лучше. Спасибо!",
    color: "gray",
    rating: [1, 1, 1, 1, 0],
    avatar: "Ki",
  },
  {
    number: 2,
    FullName: "Daniar Toloev",
    date: "16 Сентября 2023",
    title:
      "Не люблю стоматологии, но в этой клинике мне стало комфортно. Врачи создают доверительную атмосферу. Спасибо за терпение и заботу!",
    color: "rgb(255,255,102)",
    rating: [1, 1, 1, 1, 0],
    avatar: "Da",
  },
  {
    number: 3,
    FullName: "Altynbek Bolotov",
    date: "30 Августа 2023",
    title:
      "Очень качественное лечение и приветливый персонал. Зубы выглядят отлично, и я не испытываю боли. Однозначно лучшая стоматология",
    color: "red",
    rating: [1, 1, 1, 1, 1],
    avatar: "Al",
  },
  {
    number: 0,
    FullName: "​Iasmin Khasanova",
    date: "16 Декабря 2023",
    title:
      "Отличная клиника! Хорошее новое оборудование, цены демократичные. Советую",
    color: "orange",
    rating: [1, 1, 1, 1, 1],
    avatar: "Ia",
  },
  {
    number: 1,
    FullName: "анна любимова",
    date: "4 августа 2023",
    title: "Хорошие стоматологи, чисто, пахнет приятно, персонал вежливый",
    color: "brown",
    rating: [1, 1, 1, 1, 1],
    avatar: "ан",
  },
  {
    number: 2,
    FullName: "​Пашка ……",
    date: "29 марта 2022",
    title: "Наталья Юрьевна потрясающий стоматолог!!!",
    color: "gray",
    rating: [1, 1, 1, 1, 1],
    avatar: "Па",
  },
  {
    number: 3,
    FullName: "Таалайгуль Конокбаева",
    date: "2 июня 2021",
    title:
      "Классно, все вообще без болезненно. Я боялась стомотологов, попал с врачу Эмиль, аккуратно, объяснил и всё сделал отлично 👍👍👍👍👍",
    color: "skyblue",
    rating: [1, 1, 1, 1, 1],
    avatar: "Та",
  },
  {
    number: 0,
    FullName: "Adel Rahmanova",
    date: "29 Ноября 2023",
    title:
      "Хочу выразить огромную благодарность Estetic Clinic! Замечательные врачи 😍 Мээрим Макешева золотые руки , супер быстро , без боли , врач от бога !",
    color: "green",
    rating: [1, 1, 1, 1, 1],
    avatar: "Ad",
  },
  {
    number: 1,
    FullName: "MYRZA (KIKER)",
    date: "9 сентября 2020",
    title: "Очень хороший мед центр",
    color: "violet",
    rating: [1, 1, 1, 1, 1],
    avatar: "MY",
  },
  {
    number: 2,
    FullName: "nargiza makeeva",
    date: "8 декабря 2020",
    title:
      "Прекрасная клиника обращалась по поводу сложного удаления 8го зуба , сделали все качественно и быстро!!!",
    color: "green",
    rating: [1, 1, 1, 1, 1],
    avatar: "na",
  },
  {
    number: 3,
    FullName: "​Nurkan Aliev",
    date: "22 января 2020",
    title:
      "Чисто, уютно, что очень располагает к себе Менял пломбы, все сделали качественно. Понравилось то, что врачи соблюдают",
    color: "brown",
    rating: [1, 1, 1, 1, 1],
    avatar: "Nu",
  },
  {
    number: 0,
    FullName: "​Aksana Aralbaeva",
    date: "29 Ноября 2023",
    title:
      "Пришла первый раз, очень довольна обслуживанием и высшей категории врача Мээрим!",
    color: "red",
    rating: [1, 1, 1, 1, 1],
    avatar: "Ak",
  },
  {
    number: 2,
    FullName: "​Баха Стакиев",
    date: "8 декабря 2020",
    title:
      "Хорошая клиника ! Советую всем !Врач Нурлан классный.Все объяснил простым языком . У вас золотые руки .",
    color: "red",
    rating: [1, 1, 1, 1, 1],
    avatar: "Ба",
  },
  {
    number: 3,
    FullName: "Yulia Yangaeva",
    date: "16 марта 2023",
    title:
      "Всем рекомендую Ортодонта Амирова Али Амировича👍профессионал своего дела.",
    color: "red",
    rating: [1, 1, 1, 1, 1],
    avatar: "Yu",
  },
  {
    number: 0,
    FullName: "​Бион Борисфенит",
    date: "2 марта 2023",
    title:
      "Всем рекомендую особенно Нурдоолот Казыбековича качество и аккуратность всё объясняет понятно и ясно",
    color: "gray",
    rating: [1, 1, 1, 1, 1],
    avatar: "БС",
  },
  {
    number: 1,
    FullName: "​Шкет Шкетович",
    date: "12 ноября 2022",
    title:
      "Просто потрясающая клиника, всё сделали очень аккуратно, нет никаких претензий. Всем рекомендую!",
    color: "orange",
    rating: [1, 1, 1, 1, 1],
    avatar: "Шк",
  },
];

export const CalculateRating = (positive: any, negative: any, ok: number) => {
  if (ok) {
    return positive;
  } else {
    return negative;
  }
};
